hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_uart_regs.h
/*
 * Copyright (c) 2021-2026 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_UART_H
#define HPM_UART_H

typedef struct {
    __R  uint8_t  RESERVED0[4];                /* 0x0 - 0x3: Reserved */
    __RW uint32_t IDLE_CFG;                    /* 0x4: Idle Configuration Register */
    __RW uint32_t ADDR_CFG;                    /* 0x8: address match config register */
    __RW uint32_t IIR2;                        /* 0xC: Interrupt Identification Register2 */
    __RW uint32_t CFG;                         /* 0x10: Configuration Register */
    __RW uint32_t OSCR;                        /* 0x14: Over Sample Control Register */
    __RW uint32_t FCRR;                        /* 0x18: FIFO Control Register config */
    __RW uint32_t MOTO_CFG;                    /* 0x1C: moto system control register */
    union {
        __R  uint32_t RBR;                     /* 0x20: Receiver Buffer Register (when DLAB = 0) */
        __W  uint32_t THR;                     /* 0x20: Transmitter Holding Register (when DLAB = 0) */
        __RW uint32_t DLL;                     /* 0x20: Divisor Latch LSB (when DLAB = 1) */
    };
    union {
        __RW uint32_t IER;                     /* 0x24: Interrupt Enable Register (when DLAB = 0) */
        __RW uint32_t DLM;                     /* 0x24: Divisor Latch MSB (when DLAB = 1) */
    };
    union {
        __RW uint32_t IIR;                     /* 0x28: Interrupt Identification Register */
        __W  uint32_t FCR;                     /* 0x28: FIFO Control Register */
    };
    __RW uint32_t LCR;                         /* 0x2C: Line Control Register */
    __RW uint32_t MCR;                         /* 0x30: Modem Control Register ( */
    __R  uint32_t LSR;                         /* 0x34: Line Status Register */
    __R  uint32_t MSR;                         /* 0x38: Modem Status Register */
    __RW uint32_t GPR;                         /* 0x3C: GPR Register */
} UART_Type;


/* Bitfield definition for register: IDLE_CFG */
/*
 * TX_IDLE_COND (RW)
 *
 * IDLE Detection Condition
 * 0 - Treat as idle if TX pin is logic one
 * 1 - Treat as idle if UART state machine state is idle
 */
#define UART_IDLE_CFG_TX_IDLE_COND_MASK (0x2000000UL)
#define UART_IDLE_CFG_TX_IDLE_COND_SHIFT (25U)
#define UART_IDLE_CFG_TX_IDLE_COND_SET(x) (((uint32_t)(x) << UART_IDLE_CFG_TX_IDLE_COND_SHIFT) & UART_IDLE_CFG_TX_IDLE_COND_MASK)
#define UART_IDLE_CFG_TX_IDLE_COND_GET(x) (((uint32_t)(x) & UART_IDLE_CFG_TX_IDLE_COND_MASK) >> UART_IDLE_CFG_TX_IDLE_COND_SHIFT)

/*
 * TX_IDLE_EN (RW)
 *
 * UART TX Idle Detect Enable
 * 0 - Disable
 * 1 - Enable
 */
#define UART_IDLE_CFG_TX_IDLE_EN_MASK (0x1000000UL)
#define UART_IDLE_CFG_TX_IDLE_EN_SHIFT (24U)
#define UART_IDLE_CFG_TX_IDLE_EN_SET(x) (((uint32_t)(x) << UART_IDLE_CFG_TX_IDLE_EN_SHIFT) & UART_IDLE_CFG_TX_IDLE_EN_MASK)
#define UART_IDLE_CFG_TX_IDLE_EN_GET(x) (((uint32_t)(x) & UART_IDLE_CFG_TX_IDLE_EN_MASK) >> UART_IDLE_CFG_TX_IDLE_EN_SHIFT)

/*
 * TX_IDLE_THR (RW)
 *
 * Threshold for UART transmit Idle detection (in terms of bits)
 */
#define UART_IDLE_CFG_TX_IDLE_THR_MASK (0xFF0000UL)
#define UART_IDLE_CFG_TX_IDLE_THR_SHIFT (16U)
#define UART_IDLE_CFG_TX_IDLE_THR_SET(x) (((uint32_t)(x) << UART_IDLE_CFG_TX_IDLE_THR_SHIFT) & UART_IDLE_CFG_TX_IDLE_THR_MASK)
#define UART_IDLE_CFG_TX_IDLE_THR_GET(x) (((uint32_t)(x) & UART_IDLE_CFG_TX_IDLE_THR_MASK) >> UART_IDLE_CFG_TX_IDLE_THR_SHIFT)

/*
 * RXEN (RW)
 *
 * UART receive enable.
 * 0 - hold RX input to high, avoide wrong data input when config pinmux
 * 1 - bypass RX input from PIN
 * software should set it after config pinmux
 */
#define UART_IDLE_CFG_RXEN_MASK (0x800U)
#define UART_IDLE_CFG_RXEN_SHIFT (11U)
#define UART_IDLE_CFG_RXEN_SET(x) (((uint32_t)(x) << UART_IDLE_CFG_RXEN_SHIFT) & UART_IDLE_CFG_RXEN_MASK)
#define UART_IDLE_CFG_RXEN_GET(x) (((uint32_t)(x) & UART_IDLE_CFG_RXEN_MASK) >> UART_IDLE_CFG_RXEN_SHIFT)

/*
 * RX_IDLE_COND (RW)
 *
 * IDLE Detection Condition
 * 0 - Treat as idle if RX pin is logic one
 * 1 - Treat as idle if UART state machine state is idle
 */
#define UART_IDLE_CFG_RX_IDLE_COND_MASK (0x200U)
#define UART_IDLE_CFG_RX_IDLE_COND_SHIFT (9U)
#define UART_IDLE_CFG_RX_IDLE_COND_SET(x) (((uint32_t)(x) << UART_IDLE_CFG_RX_IDLE_COND_SHIFT) & UART_IDLE_CFG_RX_IDLE_COND_MASK)
#define UART_IDLE_CFG_RX_IDLE_COND_GET(x) (((uint32_t)(x) & UART_IDLE_CFG_RX_IDLE_COND_MASK) >> UART_IDLE_CFG_RX_IDLE_COND_SHIFT)

/*
 * RX_IDLE_EN (RW)
 *
 * UART Idle Detect Enable
 * 0 - Disable
 * 1 - Enable
 * it should be enabled if enable address match feature
 */
#define UART_IDLE_CFG_RX_IDLE_EN_MASK (0x100U)
#define UART_IDLE_CFG_RX_IDLE_EN_SHIFT (8U)
#define UART_IDLE_CFG_RX_IDLE_EN_SET(x) (((uint32_t)(x) << UART_IDLE_CFG_RX_IDLE_EN_SHIFT) & UART_IDLE_CFG_RX_IDLE_EN_MASK)
#define UART_IDLE_CFG_RX_IDLE_EN_GET(x) (((uint32_t)(x) & UART_IDLE_CFG_RX_IDLE_EN_MASK) >> UART_IDLE_CFG_RX_IDLE_EN_SHIFT)

/*
 * RX_IDLE_THR (RW)
 *
 * Threshold for UART Receive Idle detection (in terms of bits)
 */
#define UART_IDLE_CFG_RX_IDLE_THR_MASK (0xFFU)
#define UART_IDLE_CFG_RX_IDLE_THR_SHIFT (0U)
#define UART_IDLE_CFG_RX_IDLE_THR_SET(x) (((uint32_t)(x) << UART_IDLE_CFG_RX_IDLE_THR_SHIFT) & UART_IDLE_CFG_RX_IDLE_THR_MASK)
#define UART_IDLE_CFG_RX_IDLE_THR_GET(x) (((uint32_t)(x) & UART_IDLE_CFG_RX_IDLE_THR_MASK) >> UART_IDLE_CFG_RX_IDLE_THR_SHIFT)

/* Bitfield definition for register: ADDR_CFG */
/*
 * TXEN_9BIT (RW)
 *
 * set to use 9bit mode for transmitter,
 * will set the MSB for the first character as address flag, keep 0 for others.
 */
#define UART_ADDR_CFG_TXEN_9BIT_MASK (0x100000UL)
#define UART_ADDR_CFG_TXEN_9BIT_SHIFT (20U)
#define UART_ADDR_CFG_TXEN_9BIT_SET(x) (((uint32_t)(x) << UART_ADDR_CFG_TXEN_9BIT_SHIFT) & UART_ADDR_CFG_TXEN_9BIT_MASK)
#define UART_ADDR_CFG_TXEN_9BIT_GET(x) (((uint32_t)(x) & UART_ADDR_CFG_TXEN_9BIT_MASK) >> UART_ADDR_CFG_TXEN_9BIT_SHIFT)

/*
 * RXEN_ADDR_MSB (RW)
 *
 * set to use MSB as address flag at receiver(actually this is done by software set correct MSB in addr0/addr1).
 * Clr to use first character as address.
 * Only needed if enable address match feature
 */
#define UART_ADDR_CFG_RXEN_ADDR_MSB_MASK (0x80000UL)
#define UART_ADDR_CFG_RXEN_ADDR_MSB_SHIFT (19U)
#define UART_ADDR_CFG_RXEN_ADDR_MSB_SET(x) (((uint32_t)(x) << UART_ADDR_CFG_RXEN_ADDR_MSB_SHIFT) & UART_ADDR_CFG_RXEN_ADDR_MSB_MASK)
#define UART_ADDR_CFG_RXEN_ADDR_MSB_GET(x) (((uint32_t)(x) & UART_ADDR_CFG_RXEN_ADDR_MSB_MASK) >> UART_ADDR_CFG_RXEN_ADDR_MSB_SHIFT)

