hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_uart_regs.h
/*
 * RXEN_9BIT (RW)
 *
 * set to use 9bit mode for receiver, only valid if rxen_addr_msb is set
 */
#define UART_ADDR_CFG_RXEN_9BIT_MASK (0x40000UL)
#define UART_ADDR_CFG_RXEN_9BIT_SHIFT (18U)
#define UART_ADDR_CFG_RXEN_9BIT_SET(x) (((uint32_t)(x) << UART_ADDR_CFG_RXEN_9BIT_SHIFT) & UART_ADDR_CFG_RXEN_9BIT_MASK)
#define UART_ADDR_CFG_RXEN_9BIT_GET(x) (((uint32_t)(x) & UART_ADDR_CFG_RXEN_9BIT_MASK) >> UART_ADDR_CFG_RXEN_9BIT_SHIFT)

/*
 * A1_EN (RW)
 *
 * enable addr1 compare for the first character.
 * If a1_en OR a0_en, then do not receive data if address not match.
 * If ~a1_en AND ~a0_en, the receive all data like before.
 * NOTE: should set idle_tmout_en if enable address match feature
 */
#define UART_ADDR_CFG_A1_EN_MASK (0x20000UL)
#define UART_ADDR_CFG_A1_EN_SHIFT (17U)
#define UART_ADDR_CFG_A1_EN_SET(x) (((uint32_t)(x) << UART_ADDR_CFG_A1_EN_SHIFT) & UART_ADDR_CFG_A1_EN_MASK)
#define UART_ADDR_CFG_A1_EN_GET(x) (((uint32_t)(x) & UART_ADDR_CFG_A1_EN_MASK) >> UART_ADDR_CFG_A1_EN_SHIFT)

/*
 * A0_EN (RW)
 *
 * enable addr0 compare for the first character
 */
#define UART_ADDR_CFG_A0_EN_MASK (0x10000UL)
#define UART_ADDR_CFG_A0_EN_SHIFT (16U)
#define UART_ADDR_CFG_A0_EN_SET(x) (((uint32_t)(x) << UART_ADDR_CFG_A0_EN_SHIFT) & UART_ADDR_CFG_A0_EN_MASK)
#define UART_ADDR_CFG_A0_EN_GET(x) (((uint32_t)(x) & UART_ADDR_CFG_A0_EN_MASK) >> UART_ADDR_CFG_A0_EN_SHIFT)

/*
 * ADDR1 (RW)
 *
 * address 1 fileld.
 * in 9bit mode, this is the full address byte.
 * For other mode(8/7/6/5bit), MSB should be set for address flag.
 * If want address==0 to be matched at 8bit mode, should set addr1=0x80
 */
#define UART_ADDR_CFG_ADDR1_MASK (0xFF00U)
#define UART_ADDR_CFG_ADDR1_SHIFT (8U)
#define UART_ADDR_CFG_ADDR1_SET(x) (((uint32_t)(x) << UART_ADDR_CFG_ADDR1_SHIFT) & UART_ADDR_CFG_ADDR1_MASK)
#define UART_ADDR_CFG_ADDR1_GET(x) (((uint32_t)(x) & UART_ADDR_CFG_ADDR1_MASK) >> UART_ADDR_CFG_ADDR1_SHIFT)

/*
 * ADDR0 (RW)
 *
 * address 0 field.
 */
#define UART_ADDR_CFG_ADDR0_MASK (0xFFU)
#define UART_ADDR_CFG_ADDR0_SHIFT (0U)
#define UART_ADDR_CFG_ADDR0_SET(x) (((uint32_t)(x) << UART_ADDR_CFG_ADDR0_SHIFT) & UART_ADDR_CFG_ADDR0_MASK)
#define UART_ADDR_CFG_ADDR0_GET(x) (((uint32_t)(x) & UART_ADDR_CFG_ADDR0_MASK) >> UART_ADDR_CFG_ADDR0_SHIFT)

/* Bitfield definition for register: IIR2 */
/*
 * RXIDLE_FLAG (W1C)
 *
 * UART RX IDLE Flag, assert after rxd high and then rx idle timeout, write one clear
 * 0 - UART RX is busy
 * 1 - UART RX is idle
 */
#define UART_IIR2_RXIDLE_FLAG_MASK (0x80000000UL)
#define UART_IIR2_RXIDLE_FLAG_SHIFT (31U)
#define UART_IIR2_RXIDLE_FLAG_SET(x) (((uint32_t)(x) << UART_IIR2_RXIDLE_FLAG_SHIFT) & UART_IIR2_RXIDLE_FLAG_MASK)
#define UART_IIR2_RXIDLE_FLAG_GET(x) (((uint32_t)(x) & UART_IIR2_RXIDLE_FLAG_MASK) >> UART_IIR2_RXIDLE_FLAG_SHIFT)

/*
 * TXIDLE_FLAG (W1C)
 *
 * UART TX IDLE Flag, assert after txd high and then tx idle timeout, write one clear
 * 0 - UART TX is busy
 * 1 - UART TX is idle
 */
#define UART_IIR2_TXIDLE_FLAG_MASK (0x40000000UL)
#define UART_IIR2_TXIDLE_FLAG_SHIFT (30U)
#define UART_IIR2_TXIDLE_FLAG_SET(x) (((uint32_t)(x) << UART_IIR2_TXIDLE_FLAG_SHIFT) & UART_IIR2_TXIDLE_FLAG_MASK)
#define UART_IIR2_TXIDLE_FLAG_GET(x) (((uint32_t)(x) & UART_IIR2_TXIDLE_FLAG_MASK) >> UART_IIR2_TXIDLE_FLAG_SHIFT)

/*
 * ADDR_MATCH (W1C)
 *
 * address match irq status, assert if either address match(and enabled). Write one clear
 * NOTE: the address byte may not moved by DMA at this point.
 * User can wait next addr_match_idle irq for the whole data include address
 */
#define UART_IIR2_ADDR_MATCH_MASK (0x20000000UL)
#define UART_IIR2_ADDR_MATCH_SHIFT (29U)
#define UART_IIR2_ADDR_MATCH_SET(x) (((uint32_t)(x) << UART_IIR2_ADDR_MATCH_SHIFT) & UART_IIR2_ADDR_MATCH_MASK)
#define UART_IIR2_ADDR_MATCH_GET(x) (((uint32_t)(x) & UART_IIR2_ADDR_MATCH_MASK) >> UART_IIR2_ADDR_MATCH_SHIFT)

/*
 * ADDR_MATCH_IDLE (W1C)
 *
 * address match and idle irq status, assert at rx bus idle if address match event triggered.
 * Write one clear;
 */
#define UART_IIR2_ADDR_MATCH_IDLE_MASK (0x10000000UL)
#define UART_IIR2_ADDR_MATCH_IDLE_SHIFT (28U)
#define UART_IIR2_ADDR_MATCH_IDLE_SET(x) (((uint32_t)(x) << UART_IIR2_ADDR_MATCH_IDLE_SHIFT) & UART_IIR2_ADDR_MATCH_IDLE_MASK)
#define UART_IIR2_ADDR_MATCH_IDLE_GET(x) (((uint32_t)(x) & UART_IIR2_ADDR_MATCH_IDLE_MASK) >> UART_IIR2_ADDR_MATCH_IDLE_SHIFT)

/*
 * DATA_LOST (W1C)
 *
 * assert if data lost before address match status, write one clear;
 * It will not assert if no address match occurs
 */
#define UART_IIR2_DATA_LOST_MASK (0x8000000UL)
#define UART_IIR2_DATA_LOST_SHIFT (27U)
#define UART_IIR2_DATA_LOST_SET(x) (((uint32_t)(x) << UART_IIR2_DATA_LOST_SHIFT) & UART_IIR2_DATA_LOST_MASK)
#define UART_IIR2_DATA_LOST_GET(x) (((uint32_t)(x) & UART_IIR2_DATA_LOST_MASK) >> UART_IIR2_DATA_LOST_SHIFT)

/*
 * LSR_ERRF_STS (W1C)
 *
 * Receiving FIFO error status，when occurs parity error、framing error or break error,it will generatei;write 1 clear to 0
 */
#define UART_IIR2_LSR_ERRF_STS_MASK (0x4000000UL)
#define UART_IIR2_LSR_ERRF_STS_SHIFT (26U)
#define UART_IIR2_LSR_ERRF_STS_SET(x) (((uint32_t)(x) << UART_IIR2_LSR_ERRF_STS_SHIFT) & UART_IIR2_LSR_ERRF_STS_MASK)
#define UART_IIR2_LSR_ERRF_STS_GET(x) (((uint32_t)(x) & UART_IIR2_LSR_ERRF_STS_MASK) >> UART_IIR2_LSR_ERRF_STS_SHIFT)

/*
 * LSR_BREAK_STS (W1C)
 *
 * Transmission break status, when occurs break error,it will generate;write 1 clear 0
 */
#define UART_IIR2_LSR_BREAK_STS_MASK (0x2000000UL)
#define UART_IIR2_LSR_BREAK_STS_SHIFT (25U)
#define UART_IIR2_LSR_BREAK_STS_SET(x) (((uint32_t)(x) << UART_IIR2_LSR_BREAK_STS_SHIFT) & UART_IIR2_LSR_BREAK_STS_MASK)
#define UART_IIR2_LSR_BREAK_STS_GET(x) (((uint32_t)(x) & UART_IIR2_LSR_BREAK_STS_MASK) >> UART_IIR2_LSR_BREAK_STS_SHIFT)

/*
 * LSR_FRAMING_STS (W1C)
 *
 * Framing error status,when occurs frame error,it will generate;write 1 clear 0
 */
#define UART_IIR2_LSR_FRAMING_STS_MASK (0x1000000UL)
#define UART_IIR2_LSR_FRAMING_STS_SHIFT (24U)
#define UART_IIR2_LSR_FRAMING_STS_SET(x) (((uint32_t)(x) << UART_IIR2_LSR_FRAMING_STS_SHIFT) & UART_IIR2_LSR_FRAMING_STS_MASK)
#define UART_IIR2_LSR_FRAMING_STS_GET(x) (((uint32_t)(x) & UART_IIR2_LSR_FRAMING_STS_MASK) >> UART_IIR2_LSR_FRAMING_STS_SHIFT)

