hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_uart_regs.h
/*
 * LSR_PARITY_STS (W1C)
 *
 * Parity error status,when occurs parity error ,it will generate;write 1 clear 0
 */
#define UART_IIR2_LSR_PARITY_STS_MASK (0x800000UL)
#define UART_IIR2_LSR_PARITY_STS_SHIFT (23U)
#define UART_IIR2_LSR_PARITY_STS_SET(x) (((uint32_t)(x) << UART_IIR2_LSR_PARITY_STS_SHIFT) & UART_IIR2_LSR_PARITY_STS_MASK)
#define UART_IIR2_LSR_PARITY_STS_GET(x) (((uint32_t)(x) & UART_IIR2_LSR_PARITY_STS_MASK) >> UART_IIR2_LSR_PARITY_STS_SHIFT)

/*
 * LSR_OVERRUN_STS (W1C)
 *
 * Receive data overload status;when occurs overrun error ,it will generate;write 1 clear 0
 */
#define UART_IIR2_LSR_OVERRUN_STS_MASK (0x400000UL)
#define UART_IIR2_LSR_OVERRUN_STS_SHIFT (22U)
#define UART_IIR2_LSR_OVERRUN_STS_SET(x) (((uint32_t)(x) << UART_IIR2_LSR_OVERRUN_STS_SHIFT) & UART_IIR2_LSR_OVERRUN_STS_MASK)
#define UART_IIR2_LSR_OVERRUN_STS_GET(x) (((uint32_t)(x) & UART_IIR2_LSR_OVERRUN_STS_MASK) >> UART_IIR2_LSR_OVERRUN_STS_SHIFT)

/*
 * FIFOED (RO)
 *
 * FIFOs enabled
 * These two bits are 1 when bit 0 of the FIFO Control
 * Register (FIFOE) is set to 1.
 */
#define UART_IIR2_FIFOED_MASK (0xC0U)
#define UART_IIR2_FIFOED_SHIFT (6U)
#define UART_IIR2_FIFOED_GET(x) (((uint32_t)(x) & UART_IIR2_FIFOED_MASK) >> UART_IIR2_FIFOED_SHIFT)

/*
 * INTRID (RO)
 *
 * Interrupt ID, see IIR2 for detail decoding
 */
#define UART_IIR2_INTRID_MASK (0xFU)
#define UART_IIR2_INTRID_SHIFT (0U)
#define UART_IIR2_INTRID_GET(x) (((uint32_t)(x) & UART_IIR2_INTRID_MASK) >> UART_IIR2_INTRID_SHIFT)

/* Bitfield definition for register: CFG */
/*
 * FIFOSIZE (RO)
 *
 * The depth of RXFIFO and TXFIFO
 * 0: 16-byte FIFO
 * 1: 32-byte FIFO
 * 2: 64-byte FIFO
 * 3: 128-byte FIFO
 */
#define UART_CFG_FIFOSIZE_MASK (0x3U)
#define UART_CFG_FIFOSIZE_SHIFT (0U)
#define UART_CFG_FIFOSIZE_GET(x) (((uint32_t)(x) & UART_CFG_FIFOSIZE_MASK) >> UART_CFG_FIFOSIZE_SHIFT)

/* Bitfield definition for register: OSCR */
/*
 * OSC (RW)
 *
 * Over-sample control
 * The value must be an even number; any odd value
 * writes to this field will be converted to an even value.
 * OSC=0: reserved
 * OSC<=8: The over-sample ratio is 8
 * 8 < OSC< 32: The over sample ratio is OSC
 */
#define UART_OSCR_OSC_MASK (0x1FU)
#define UART_OSCR_OSC_SHIFT (0U)
#define UART_OSCR_OSC_SET(x) (((uint32_t)(x) << UART_OSCR_OSC_SHIFT) & UART_OSCR_OSC_MASK)
#define UART_OSCR_OSC_GET(x) (((uint32_t)(x) & UART_OSCR_OSC_MASK) >> UART_OSCR_OSC_SHIFT)

/* Bitfield definition for register: FCRR */
/*
 * DMA_STOP_EN (RW)
 *
 * enable dma stopped function
 */
#define UART_FCRR_DMA_STOP_EN_MASK (0x80000000UL)
#define UART_FCRR_DMA_STOP_EN_SHIFT (31U)
#define UART_FCRR_DMA_STOP_EN_SET(x) (((uint32_t)(x) << UART_FCRR_DMA_STOP_EN_SHIFT) & UART_FCRR_DMA_STOP_EN_MASK)
#define UART_FCRR_DMA_STOP_EN_GET(x) (((uint32_t)(x) & UART_FCRR_DMA_STOP_EN_MASK) >> UART_FCRR_DMA_STOP_EN_SHIFT)

/*
 * DMA_STOPPED_WRITE_CLEAR (WO)
 *
 * dma stopped function by writing 1 clear 0
 */
#define UART_FCRR_DMA_STOPPED_WRITE_CLEAR_MASK (0x40000000UL)
#define UART_FCRR_DMA_STOPPED_WRITE_CLEAR_SHIFT (30U)
#define UART_FCRR_DMA_STOPPED_WRITE_CLEAR_SET(x) (((uint32_t)(x) << UART_FCRR_DMA_STOPPED_WRITE_CLEAR_SHIFT) & UART_FCRR_DMA_STOPPED_WRITE_CLEAR_MASK)
#define UART_FCRR_DMA_STOPPED_WRITE_CLEAR_GET(x) (((uint32_t)(x) & UART_FCRR_DMA_STOPPED_WRITE_CLEAR_MASK) >> UART_FCRR_DMA_STOPPED_WRITE_CLEAR_SHIFT)

/*
 * BAUD_ACT_ENJ_PCLK (RW)
 *
 * Set the value of the configuration object.
 */
#define UART_FCRR_BAUD_ACT_ENJ_PCLK_MASK (0x2000000UL)
#define UART_FCRR_BAUD_ACT_ENJ_PCLK_SHIFT (25U)
#define UART_FCRR_BAUD_ACT_ENJ_PCLK_SET(x) (((uint32_t)(x) << UART_FCRR_BAUD_ACT_ENJ_PCLK_SHIFT) & UART_FCRR_BAUD_ACT_ENJ_PCLK_MASK)
#define UART_FCRR_BAUD_ACT_ENJ_PCLK_GET(x) (((uint32_t)(x) & UART_FCRR_BAUD_ACT_ENJ_PCLK_MASK) >> UART_FCRR_BAUD_ACT_ENJ_PCLK_SHIFT)

/*
 * TMOUT_RXDMA_DIS (RW)
 *
 * set to disable timeout rx dma request
 */
#define UART_FCRR_TMOUT_RXDMA_DIS_MASK (0x1000000UL)
#define UART_FCRR_TMOUT_RXDMA_DIS_SHIFT (24U)
#define UART_FCRR_TMOUT_RXDMA_DIS_SET(x) (((uint32_t)(x) << UART_FCRR_TMOUT_RXDMA_DIS_SHIFT) & UART_FCRR_TMOUT_RXDMA_DIS_MASK)
#define UART_FCRR_TMOUT_RXDMA_DIS_GET(x) (((uint32_t)(x) & UART_FCRR_TMOUT_RXDMA_DIS_MASK) >> UART_FCRR_TMOUT_RXDMA_DIS_SHIFT)

/*
 * FIFOT4EN (RW)
 *
 * set to use new 4bit fifo threshold(TFIFOT4 and RFIFOT4)
 * clr to use 2bit(TFIFOT and RFIFOT)
 */
#define UART_FCRR_FIFOT4EN_MASK (0x800000UL)
#define UART_FCRR_FIFOT4EN_SHIFT (23U)
#define UART_FCRR_FIFOT4EN_SET(x) (((uint32_t)(x) << UART_FCRR_FIFOT4EN_SHIFT) & UART_FCRR_FIFOT4EN_MASK)
#define UART_FCRR_FIFOT4EN_GET(x) (((uint32_t)(x) & UART_FCRR_FIFOT4EN_MASK) >> UART_FCRR_FIFOT4EN_SHIFT)

/*
 * TFIFOT4 (RW)
 *
 * txfifo threshold(0 for 1byte, 0xF for 32bytes), uart will send tx_dma_req when data in fifo is less than threshold.
 */
#define UART_FCRR_TFIFOT4_MASK (0x1F0000UL)
#define UART_FCRR_TFIFOT4_SHIFT (16U)
#define UART_FCRR_TFIFOT4_SET(x) (((uint32_t)(x) << UART_FCRR_TFIFOT4_SHIFT) & UART_FCRR_TFIFOT4_MASK)
#define UART_FCRR_TFIFOT4_GET(x) (((uint32_t)(x) & UART_FCRR_TFIFOT4_MASK) >> UART_FCRR_TFIFOT4_SHIFT)

/*
 * RFIFOT4 (RW)
 *
 * rxfifo threshold(0 for 1byte, 0xF for 32bytes).
 * Uart will send rx_dma_req if data in fifo reachs the threshold, also will set the rxdata irq if enabled
 */
#define UART_FCRR_RFIFOT4_MASK (0x1F00U)
#define UART_FCRR_RFIFOT4_SHIFT (8U)
#define UART_FCRR_RFIFOT4_SET(x) (((uint32_t)(x) << UART_FCRR_RFIFOT4_SHIFT) & UART_FCRR_RFIFOT4_MASK)
#define UART_FCRR_RFIFOT4_GET(x) (((uint32_t)(x) & UART_FCRR_RFIFOT4_MASK) >> UART_FCRR_RFIFOT4_SHIFT)

/*
 * RFIFOT (RW)
 *
 * Receiver FIFO trigger level
 */
#define UART_FCRR_RFIFOT_MASK (0xC0U)
#define UART_FCRR_RFIFOT_SHIFT (6U)
#define UART_FCRR_RFIFOT_SET(x) (((uint32_t)(x) << UART_FCRR_RFIFOT_SHIFT) & UART_FCRR_RFIFOT_MASK)
#define UART_FCRR_RFIFOT_GET(x) (((uint32_t)(x) & UART_FCRR_RFIFOT_MASK) >> UART_FCRR_RFIFOT_SHIFT)

/*
 * TFIFOT (RW)
 *
 * Transmitter FIFO trigger level
 */
#define UART_FCRR_TFIFOT_MASK (0x30U)
#define UART_FCRR_TFIFOT_SHIFT (4U)
#define UART_FCRR_TFIFOT_SET(x) (((uint32_t)(x) << UART_FCRR_TFIFOT_SHIFT) & UART_FCRR_TFIFOT_MASK)
#define UART_FCRR_TFIFOT_GET(x) (((uint32_t)(x) & UART_FCRR_TFIFOT_MASK) >> UART_FCRR_TFIFOT_SHIFT)

