hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_uart_regs.h
/*
 * DMAE (RW)
 *
 * DMA enable
 * 0: Disable
 * 1: Enable
 */
#define UART_FCRR_DMAE_MASK (0x8U)
#define UART_FCRR_DMAE_SHIFT (3U)
#define UART_FCRR_DMAE_SET(x) (((uint32_t)(x) << UART_FCRR_DMAE_SHIFT) & UART_FCRR_DMAE_MASK)
#define UART_FCRR_DMAE_GET(x) (((uint32_t)(x) & UART_FCRR_DMAE_MASK) >> UART_FCRR_DMAE_SHIFT)

/*
 * TFIFORST (WO)
 *
 * Transmitter FIFO reset
 * Write 1 to clear all bytes in the TXFIFO and resets its
 * counter. The Transmitter Shift Register is not cleared.
 * This bit will automatically be cleared.
 */
#define UART_FCRR_TFIFORST_MASK (0x4U)
#define UART_FCRR_TFIFORST_SHIFT (2U)
#define UART_FCRR_TFIFORST_SET(x) (((uint32_t)(x) << UART_FCRR_TFIFORST_SHIFT) & UART_FCRR_TFIFORST_MASK)
#define UART_FCRR_TFIFORST_GET(x) (((uint32_t)(x) & UART_FCRR_TFIFORST_MASK) >> UART_FCRR_TFIFORST_SHIFT)

/*
 * RFIFORST (WO)
 *
 * Receiver FIFO reset
 * Write 1 to clear all bytes in the RXFIFO and resets its
 * counter. The Receiver Shift Register is not cleared.
 * This bit will automatically be cleared.
 */
#define UART_FCRR_RFIFORST_MASK (0x2U)
#define UART_FCRR_RFIFORST_SHIFT (1U)
#define UART_FCRR_RFIFORST_SET(x) (((uint32_t)(x) << UART_FCRR_RFIFORST_SHIFT) & UART_FCRR_RFIFORST_MASK)
#define UART_FCRR_RFIFORST_GET(x) (((uint32_t)(x) & UART_FCRR_RFIFORST_MASK) >> UART_FCRR_RFIFORST_SHIFT)

/*
 * FIFOE (RW)
 *
 * FIFO enable
 * Write 1 to enable both the transmitter and receiver
 * FIFOs.
 * The FIFOs are reset when the value of this bit toggles.
 */
#define UART_FCRR_FIFOE_MASK (0x1U)
#define UART_FCRR_FIFOE_SHIFT (0U)
#define UART_FCRR_FIFOE_SET(x) (((uint32_t)(x) << UART_FCRR_FIFOE_SHIFT) & UART_FCRR_FIFOE_MASK)
#define UART_FCRR_FIFOE_GET(x) (((uint32_t)(x) & UART_FCRR_FIFOE_MASK) >> UART_FCRR_FIFOE_SHIFT)

/* Bitfield definition for register: MOTO_CFG */
/*
 * SWTRG (WO)
 *
 * software trigger. User should avoid use sw/hw trigger at same time, otherwise result unknown.
 * Hardware auto reset.
 */
#define UART_MOTO_CFG_SWTRG_MASK (0x80000000UL)
#define UART_MOTO_CFG_SWTRG_SHIFT (31U)
#define UART_MOTO_CFG_SWTRG_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_SWTRG_SHIFT) & UART_MOTO_CFG_SWTRG_MASK)
#define UART_MOTO_CFG_SWTRG_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_SWTRG_MASK) >> UART_MOTO_CFG_SWTRG_SHIFT)

/*
 * TXSTOP_OPT (RW)
 *
 * set to use baud_mx as txstop_bits counter, for control DE delay after STOP
 */
#define UART_MOTO_CFG_TXSTOP_OPT_MASK (0x1000000UL)
#define UART_MOTO_CFG_TXSTOP_OPT_SHIFT (24U)
#define UART_MOTO_CFG_TXSTOP_OPT_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_TXSTOP_OPT_SHIFT) & UART_MOTO_CFG_TXSTOP_OPT_MASK)
#define UART_MOTO_CFG_TXSTOP_OPT_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_TXSTOP_OPT_MASK) >> UART_MOTO_CFG_TXSTOP_OPT_SHIFT)

/*
 * TXPRE_DLY (RW)
 *
 * if set to none-zero value, will assert DE before START bit, with the unit of clock dividered after dll/dlm
 */
#define UART_MOTO_CFG_TXPRE_DLY_MASK (0xFF0000UL)
#define UART_MOTO_CFG_TXPRE_DLY_SHIFT (16U)
#define UART_MOTO_CFG_TXPRE_DLY_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_TXPRE_DLY_SHIFT) & UART_MOTO_CFG_TXPRE_DLY_MASK)
#define UART_MOTO_CFG_TXPRE_DLY_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_TXPRE_DLY_MASK) >> UART_MOTO_CFG_TXPRE_DLY_SHIFT)

/*
 * TXSTP_BITS (RW)
 *
 * if TXSTOP_INSERT is enabled, the STOP bits to be inserted between each byte. 0 for 1 bit;  0xFF for 256bits
 */
#define UART_MOTO_CFG_TXSTP_BITS_MASK (0xFF00U)
#define UART_MOTO_CFG_TXSTP_BITS_SHIFT (8U)
#define UART_MOTO_CFG_TXSTP_BITS_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_TXSTP_BITS_SHIFT) & UART_MOTO_CFG_TXSTP_BITS_MASK)
#define UART_MOTO_CFG_TXSTP_BITS_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_TXSTP_BITS_MASK) >> UART_MOTO_CFG_TXSTP_BITS_SHIFT)

/*
 * HWTRG_EN (RW)
 *
 * set to enable hardware trigger(trigger from moto is shared by other UART)
 */
#define UART_MOTO_CFG_HWTRG_EN_MASK (0x80U)
#define UART_MOTO_CFG_HWTRG_EN_SHIFT (7U)
#define UART_MOTO_CFG_HWTRG_EN_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_HWTRG_EN_SHIFT) & UART_MOTO_CFG_HWTRG_EN_MASK)
#define UART_MOTO_CFG_HWTRG_EN_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_HWTRG_EN_MASK) >> UART_MOTO_CFG_HWTRG_EN_SHIFT)

/*
 * TRG_MODE (RW)
 *
 * set to enable trigger mode.
 * software should push needed data into txbuffer frist, uart will not start transmission at this time.
 * User should send trigger signal(by hw or sw), uart will send all data in txfifo till  empty
 * NOTE: the hw_trigger should be pulse signal from trig mux.
 */
#define UART_MOTO_CFG_TRG_MODE_MASK (0x40U)
#define UART_MOTO_CFG_TRG_MODE_SHIFT (6U)
#define UART_MOTO_CFG_TRG_MODE_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_TRG_MODE_SHIFT) & UART_MOTO_CFG_TRG_MODE_MASK)
#define UART_MOTO_CFG_TRG_MODE_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_TRG_MODE_MASK) >> UART_MOTO_CFG_TRG_MODE_SHIFT)

/*
 * TRG_CLR_RFIFO (RW)
 *
 * set to enable the feature that, clear rxfifo at tx trigger(sw or hw), avoid unexpected data in rxfifo.
 */
#define UART_MOTO_CFG_TRG_CLR_RFIFO_MASK (0x20U)
#define UART_MOTO_CFG_TRG_CLR_RFIFO_SHIFT (5U)
#define UART_MOTO_CFG_TRG_CLR_RFIFO_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_TRG_CLR_RFIFO_SHIFT) & UART_MOTO_CFG_TRG_CLR_RFIFO_MASK)
#define UART_MOTO_CFG_TRG_CLR_RFIFO_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_TRG_CLR_RFIFO_MASK) >> UART_MOTO_CFG_TRG_CLR_RFIFO_SHIFT)

/*
 * TXSTOP_INSERT (RW)
 *
 * set to insert STOP bits between each tx byte till tx fifo empty.
 * NOTE: there will be no 1.5/2 STOP bits if enabled this feature, LCR.STB should be set to 0 if this bit is set
 */
#define UART_MOTO_CFG_TXSTOP_INSERT_MASK (0x10U)
#define UART_MOTO_CFG_TXSTOP_INSERT_SHIFT (4U)
#define UART_MOTO_CFG_TXSTOP_INSERT_SET(x) (((uint32_t)(x) << UART_MOTO_CFG_TXSTOP_INSERT_SHIFT) & UART_MOTO_CFG_TXSTOP_INSERT_MASK)
#define UART_MOTO_CFG_TXSTOP_INSERT_GET(x) (((uint32_t)(x) & UART_MOTO_CFG_TXSTOP_INSERT_MASK) >> UART_MOTO_CFG_TXSTOP_INSERT_SHIFT)

/* Bitfield definition for register: RBR */
/*
 * RX_BREAK_ERR (RO)
 *
 * can see if a break error occurs per byte of data(including intermediate state)
 */
#define UART_RBR_RX_BREAK_ERR_MASK (0x400U)
#define UART_RBR_RX_BREAK_ERR_SHIFT (10U)
#define UART_RBR_RX_BREAK_ERR_GET(x) (((uint32_t)(x) & UART_RBR_RX_BREAK_ERR_MASK) >> UART_RBR_RX_BREAK_ERR_SHIFT)

