hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_uart_regs.h
/*
 * FRAMING_ERR (RO)
 *
 * can see if a framing error occurs per byte of data(including intermediate state)
 */
#define UART_RBR_FRAMING_ERR_MASK (0x200U)
#define UART_RBR_FRAMING_ERR_SHIFT (9U)
#define UART_RBR_FRAMING_ERR_GET(x) (((uint32_t)(x) & UART_RBR_FRAMING_ERR_MASK) >> UART_RBR_FRAMING_ERR_SHIFT)

/*
 * PARITY_ERR (RO)
 *
 * can see if a  parity error occurs per byte of data(including intermediate state)
 */
#define UART_RBR_PARITY_ERR_MASK (0x100U)
#define UART_RBR_PARITY_ERR_SHIFT (8U)
#define UART_RBR_PARITY_ERR_GET(x) (((uint32_t)(x) & UART_RBR_PARITY_ERR_MASK) >> UART_RBR_PARITY_ERR_SHIFT)

/*
 * RBR (RO)
 *
 * Receive data read port
 */
#define UART_RBR_RBR_MASK (0xFFU)
#define UART_RBR_RBR_SHIFT (0U)
#define UART_RBR_RBR_GET(x) (((uint32_t)(x) & UART_RBR_RBR_MASK) >> UART_RBR_RBR_SHIFT)

/* Bitfield definition for register: THR */
/*
 * THR (WO)
 *
 * Transmit data write port
 */
#define UART_THR_THR_MASK (0xFFU)
#define UART_THR_THR_SHIFT (0U)
#define UART_THR_THR_SET(x) (((uint32_t)(x) << UART_THR_THR_SHIFT) & UART_THR_THR_MASK)
#define UART_THR_THR_GET(x) (((uint32_t)(x) & UART_THR_THR_MASK) >> UART_THR_THR_SHIFT)

/* Bitfield definition for register: DLL */
/*
 * DLL (RW)
 *
 * Least significant byte of the Divisor Latch
 */
#define UART_DLL_DLL_MASK (0xFFU)
#define UART_DLL_DLL_SHIFT (0U)
#define UART_DLL_DLL_SET(x) (((uint32_t)(x) << UART_DLL_DLL_SHIFT) & UART_DLL_DLL_MASK)
#define UART_DLL_DLL_GET(x) (((uint32_t)(x) & UART_DLL_DLL_MASK) >> UART_DLL_DLL_SHIFT)

/* Bitfield definition for register: IER */
/*
 * ERXIDLE (RW)
 *
 * Enable Receive Idle interrupt
 * 0 - Disable Idle interrupt
 * 1 - Enable Idle interrupt
 */
#define UART_IER_ERXIDLE_MASK (0x80000000UL)
#define UART_IER_ERXIDLE_SHIFT (31U)
#define UART_IER_ERXIDLE_SET(x) (((uint32_t)(x) << UART_IER_ERXIDLE_SHIFT) & UART_IER_ERXIDLE_MASK)
#define UART_IER_ERXIDLE_GET(x) (((uint32_t)(x) & UART_IER_ERXIDLE_MASK) >> UART_IER_ERXIDLE_SHIFT)

/*
 * ETXIDLE (RW)
 *
 * enable transmit idle interrupt
 */
#define UART_IER_ETXIDLE_MASK (0x40000000UL)
#define UART_IER_ETXIDLE_SHIFT (30U)
#define UART_IER_ETXIDLE_SET(x) (((uint32_t)(x) << UART_IER_ETXIDLE_SHIFT) & UART_IER_ETXIDLE_MASK)
#define UART_IER_ETXIDLE_GET(x) (((uint32_t)(x) & UART_IER_ETXIDLE_MASK) >> UART_IER_ETXIDLE_SHIFT)

/*
 * EADDRM (RW)
 *
 * enable ADDR_MATCH  interrupt
 */
#define UART_IER_EADDRM_MASK (0x20000000UL)
#define UART_IER_EADDRM_SHIFT (29U)
#define UART_IER_EADDRM_SET(x) (((uint32_t)(x) << UART_IER_EADDRM_SHIFT) & UART_IER_EADDRM_MASK)
#define UART_IER_EADDRM_GET(x) (((uint32_t)(x) & UART_IER_EADDRM_MASK) >> UART_IER_EADDRM_SHIFT)

/*
 * EADDRM_IDLE (RW)
 *
 * enable ADDR_MATCH_IDLE interrupt
 */
#define UART_IER_EADDRM_IDLE_MASK (0x10000000UL)
#define UART_IER_EADDRM_IDLE_SHIFT (28U)
#define UART_IER_EADDRM_IDLE_SET(x) (((uint32_t)(x) << UART_IER_EADDRM_IDLE_SHIFT) & UART_IER_EADDRM_IDLE_MASK)
#define UART_IER_EADDRM_IDLE_GET(x) (((uint32_t)(x) & UART_IER_EADDRM_IDLE_MASK) >> UART_IER_EADDRM_IDLE_SHIFT)

/*
 * EDATLOST (RW)
 *
 * enable DATA_LOST interrupt
 */
#define UART_IER_EDATLOST_MASK (0x8000000UL)
#define UART_IER_EDATLOST_SHIFT (27U)
#define UART_IER_EDATLOST_SET(x) (((uint32_t)(x) << UART_IER_EDATLOST_SHIFT) & UART_IER_EDATLOST_MASK)
#define UART_IER_EDATLOST_GET(x) (((uint32_t)(x) & UART_IER_EDATLOST_MASK) >> UART_IER_EDATLOST_SHIFT)

/*
 * LSR_ERRF_IRQ_EN (RW)
 *
 * enable transmission error interrupt
 */
#define UART_IER_LSR_ERRF_IRQ_EN_MASK (0x4000000UL)
#define UART_IER_LSR_ERRF_IRQ_EN_SHIFT (26U)
#define UART_IER_LSR_ERRF_IRQ_EN_SET(x) (((uint32_t)(x) << UART_IER_LSR_ERRF_IRQ_EN_SHIFT) & UART_IER_LSR_ERRF_IRQ_EN_MASK)
#define UART_IER_LSR_ERRF_IRQ_EN_GET(x) (((uint32_t)(x) & UART_IER_LSR_ERRF_IRQ_EN_MASK) >> UART_IER_LSR_ERRF_IRQ_EN_SHIFT)

/*
 * LSR_BREAK_IRQ_EN (RW)
 *
 * enable break error interrupt
 */
#define UART_IER_LSR_BREAK_IRQ_EN_MASK (0x2000000UL)
#define UART_IER_LSR_BREAK_IRQ_EN_SHIFT (25U)
#define UART_IER_LSR_BREAK_IRQ_EN_SET(x) (((uint32_t)(x) << UART_IER_LSR_BREAK_IRQ_EN_SHIFT) & UART_IER_LSR_BREAK_IRQ_EN_MASK)
#define UART_IER_LSR_BREAK_IRQ_EN_GET(x) (((uint32_t)(x) & UART_IER_LSR_BREAK_IRQ_EN_MASK) >> UART_IER_LSR_BREAK_IRQ_EN_SHIFT)

/*
 * LSR_FRAMING_IRQ_EN (RW)
 *
 * enable framing error interrupt
 */
#define UART_IER_LSR_FRAMING_IRQ_EN_MASK (0x1000000UL)
#define UART_IER_LSR_FRAMING_IRQ_EN_SHIFT (24U)
#define UART_IER_LSR_FRAMING_IRQ_EN_SET(x) (((uint32_t)(x) << UART_IER_LSR_FRAMING_IRQ_EN_SHIFT) & UART_IER_LSR_FRAMING_IRQ_EN_MASK)
#define UART_IER_LSR_FRAMING_IRQ_EN_GET(x) (((uint32_t)(x) & UART_IER_LSR_FRAMING_IRQ_EN_MASK) >> UART_IER_LSR_FRAMING_IRQ_EN_SHIFT)

/*
 * LSR_PARITY_IRQ_EN (RW)
 *
 * enable parity error interrupt
 */
#define UART_IER_LSR_PARITY_IRQ_EN_MASK (0x800000UL)
#define UART_IER_LSR_PARITY_IRQ_EN_SHIFT (23U)
#define UART_IER_LSR_PARITY_IRQ_EN_SET(x) (((uint32_t)(x) << UART_IER_LSR_PARITY_IRQ_EN_SHIFT) & UART_IER_LSR_PARITY_IRQ_EN_MASK)
#define UART_IER_LSR_PARITY_IRQ_EN_GET(x) (((uint32_t)(x) & UART_IER_LSR_PARITY_IRQ_EN_MASK) >> UART_IER_LSR_PARITY_IRQ_EN_SHIFT)

/*
 * LSR_OVERRUN_IRQ_EN (RW)
 *
 * enable data overload interrupt
 */
#define UART_IER_LSR_OVERRUN_IRQ_EN_MASK (0x400000UL)
#define UART_IER_LSR_OVERRUN_IRQ_EN_SHIFT (22U)
#define UART_IER_LSR_OVERRUN_IRQ_EN_SET(x) (((uint32_t)(x) << UART_IER_LSR_OVERRUN_IRQ_EN_SHIFT) & UART_IER_LSR_OVERRUN_IRQ_EN_MASK)
#define UART_IER_LSR_OVERRUN_IRQ_EN_GET(x) (((uint32_t)(x) & UART_IER_LSR_OVERRUN_IRQ_EN_MASK) >> UART_IER_LSR_OVERRUN_IRQ_EN_SHIFT)

/*
 * EMSI (RW)
 *
 * Enable modem status interrupt
 * The interrupt asserts when the status of one of the
 * following occurs:
 * The status of modem_rin, modem_dcdn,
 * modem_dsrn or modem_ctsn (If the auto-cts mode is
 * disabled) has been changed.
 * If the auto-cts mode is enabled (MCR bit4 (AFE) = 1),
 * modem_ctsn would be used to control the transmitter.
 */
#define UART_IER_EMSI_MASK (0x8U)
#define UART_IER_EMSI_SHIFT (3U)
#define UART_IER_EMSI_SET(x) (((uint32_t)(x) << UART_IER_EMSI_SHIFT) & UART_IER_EMSI_MASK)
#define UART_IER_EMSI_GET(x) (((uint32_t)(x) & UART_IER_EMSI_MASK) >> UART_IER_EMSI_SHIFT)

